src/integ-test/bdd-test/resources/xml/activatePaymentNoticeV2Body_with_idempotency_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>$idPSP</idPSP>
			<idBrokerPSP>$idBrokerPSP</idBrokerPSP>
			<idChannel>$idChannel</idChannel>
			<password>$password</password>
			<idempotencyKey>$idempotencyKey</idempotencyKey>
			<qrCode>
				<fiscalCode>$fiscalCode</fiscalCode>
				<noticeNumber>$noticeNumber</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>$amount</amount>
			<paymentNote>228344_1</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>